In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import re

%matplotlib inline

In [2]:
batting = pd.read_csv('data/Batting.csv')

In [3]:
batting.head()

,playerID,yearID,stint,teamID,lgID,G,AB,R,H,2B,...,RBI,SB,CS,BB,SO,IBB,HBP,SH,SF,GIDP
0,abercda01,1871,1,TRO,NaN,1,4.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,NaN,NaN,NaN,NaN,NaN
1,addybo01,1871,1,RC1,NaN,25,118.0,30.0,32.0,6.0,...,13.0,8.0,1.0,4.0,0.0,NaN,NaN,NaN,NaN,NaN
2,allisar01,1871,1,CL1,NaN,29,137.0,28.0,40.0,4.0,...,19.0,3.0,1.0,2.0,5.0,NaN,NaN,NaN,NaN,NaN
3,allisdo01,1871,1,WS3,NaN,27,133.0,28.0,44.0,10.0,...,27.0,1.0,1.0,0.0,2.0,NaN,NaN,NaN,NaN,NaN
4,ansonca01,1871,1,RC1,NaN,25,120.0,29.0,39.0,11.0,...,16.0,6.0,2.0,2.0,1.0,NaN,NaN,NaN,NaN,NaN

In [4]:
len(batting)

101332

In [5]:
batting.tail()

,playerID,yearID,stint,teamID,lgID,G,AB,R,H,2B,...,RBI,SB,CS,BB,SO,IBB,HBP,SH,SF,GIDP
101327,zitoba01,2015,1,OAK,AL,3,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
101328,zobribe01,2015,1,OAK,AL,67,235.0,39.0,63.0,20.0,...,33.0,1.0,1.0,33.0,26.0,2.0,0.0,0.0,3.0,5.0
101329,zobribe01,2015,2,KCA,AL,59,232.0,37.0,66.0,16.0,...,23.0,2.0,3.0,29.0,30.0,1.0,1.0,0.0,2.0,3.0
101330,zuninmi01,2015,1,SEA,AL,112,350.0,28.0,61.0,11.0,...,28.0,0.0,1.0,21.0,132.0,0.0,5.0,8.0,2.0,6.0
101331,zychto01,2015,1,SEA,AL,13,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

Get rid of players that have 0 at-bats, or if SF or HBP was not recorded

In [6]:
batting = batting.dropna(subset=['SF','HBP'])
batting = batting[batting['AB'] != 0.0]

Calculate OBP

In [7]:
batting['OBP'] = (batting['H'] + batting['BB'] + batting['HBP']) / (batting['AB'] + batting['BB'] + batting['HBP'] +  batting['SF'])

In [8]:
batting.head()

,playerID,yearID,stint,teamID,lgID,G,AB,R,H,2B,...,SB,CS,BB,SO,IBB,HBP,SH,SF,GIDP,OBP
36871,aaronha01,1954,1,ML1,NL,122,468.0,58.0,131.0,27.0,...,2.0,2.0,28.0,39.0,NaN,3.0,6.0,4.0,13.0,0.322068
36872,aberal01,1954,1,DET,AL,32,39.0,3.0,5.0,0.0,...,0.0,0.0,2.0,17.0,NaN,0.0,3.0,1.0,1.0,0.166667
36873,abramca01,1954,1,PIT,NL,17,42.0,6.0,6.0,1.0,...,0.0,0.0,10.0,9.0,NaN,0.0,0.0,0.0,2.0,0.307692
36874,abramca01,1954,2,BAL,AL,115,423.0,67.0,124.0,22.0,...,1.0,4.0,72.0,67.0,NaN,4.0,6.0,1.0,5.0,0.400000
36875,adamsbo03,1954,1,CIN,NL,110,390.0,69.0,105.0,25.0,...,2.0,5.0,55.0,46.0,NaN,3.0,4.0,2.0,4.0,0.362222

In [9]:
batting.tail()

,playerID,yearID,stint,teamID,lgID,G,AB,R,H,2B,...,SB,CS,BB,SO,IBB,HBP,SH,SF,GIDP,OBP
101325,zimmejo02,2015,1,WAS,NL,33,63.0,4.0,10.0,1.0,...,0.0,0.0,0.0,18.0,0.0,0.0,6.0,0.0,0.0,0.158730
101326,zimmery01,2015,1,WAS,NL,95,346.0,43.0,86.0,25.0,...,1.0,0.0,33.0,79.0,0.0,1.0,0.0,10.0,13.0,0.307692
101328,zobribe01,2015,1,OAK,AL,67,235.0,39.0,63.0,20.0,...,1.0,1.0,33.0,26.0,2.0,0.0,0.0,3.0,5.0,0.354244
101329,zobribe01,2015,2,KCA,AL,59,232.0,37.0,66.0,16.0,...,2.0,3.0,29.0,30.0,1.0,1.0,0.0,2.0,3.0,0.363636
101330,zuninmi01,2015,1,SEA,AL,112,350.0,28.0,61.0,11.0,...,0.0,1.0,21.0,132.0,0.0,5.0,8.0,2.0,6.0,0.230159

Get rid of all the useless things

In [10]:
batting = batting.drop(['G','AB','R','H','2B','3B','RBI','SB','CS','BB','SO','IBB','HBP','SH','SF','GIDP','HR'], axis=1)

In [11]:
batting.head()

        playerID  yearID  stint teamID lgID       OBP
36871  aaronha01    1954      1    ML1   NL  0.322068
36872   aberal01    1954      1    DET   AL  0.166667
36873  abramca01    1954      1    PIT   NL  0.307692
36874  abramca01    1954      2    BAL   AL  0.400000
36875  adamsbo03    1954      1    CIN   NL  0.362222

Salary data starts in 1985, so let's get rid of everything before that date.

In [12]:
batting = batting[batting['yearID'] >= 1985]

In [13]:
batting.head()

        playerID  yearID  stint teamID lgID       OBP
62238  abregjo01    1985      1    CHN   NL  0.000000
62240  adamsri02    1985      1    SFN   NL  0.228346
62242  aguaylu01    1985      1    PHI   NL  0.377551
62243  aguilri01    1985      1    NYN   NL  0.297297
62244  aikenwi01    1985      1    TOR   AL  0.291667

Get rid of more useless things

In [14]:
batting = batting.drop(['lgID','stint'], axis=1)

In [15]:
batting.head()

        playerID  yearID teamID       OBP
62238  abregjo01    1985    CHN  0.000000
62240  adamsri02    1985    SFN  0.228346
62242  aguaylu01    1985    PHI  0.377551
62243  aguilri01    1985    NYN  0.297297
62244  aikenwi01    1985    TOR  0.291667

Set the playerID as the index

In [16]:
batting.index = batting.pop('playerID')

In [17]:
batting.head()

           yearID teamID       OBP
playerID
abregjo01    1985    CHN  0.000000
adamsri02    1985    SFN  0.228346
aguaylu01    1985    PHI  0.377551
aguilri01    1985    NYN  0.297297
aikenwi01    1985    TOR  0.291667

Get rid of "perfect" players

In [18]:
batting = batting[batting['OBP'] != 1.0]

In [19]:
salaries = pd.read_csv('data/Salaries.csv',index_col=3)

In [20]:
salaries.head()

           yearID teamID lgID  salary
playerID
barkele01    1985    ATL   NL  870000
bedrost01    1985    ATL   NL  550000
benedbr01    1985    ATL   NL  545000
campri01     1985    ATL   NL  633333
ceronri01    1985    ATL   NL  625000

In [21]:
salaries = salaries.drop('lgID',axis=1)

In [22]:
salaries.head()

           yearID teamID  salary
playerID
barkele01    1985    ATL  870000
bedrost01    1985    ATL  550000
benedbr01    1985    ATL  545000
campri01     1985    ATL  633333
ceronri01    1985    ATL  625000

In [23]:
salaries_batting = salaries.merge(batting, left_index=True, right_index=True, on=['yearID','teamID'])

In [24]:
salaries_batting.head()

           yearID teamID  salary  OBP
playerID
aardsda01    2004    SFN  300000  0.0
aardsda01    2004    SFN  300000  0.0
aardsda01    2004    SFN  300000  0.0
aardsda01    2007    CHA  387500  0.0
aardsda01    2007    CHA  387500  0.0

In [25]:
salaries_batting.tail()

           yearID teamID  salary       OBP
playerID
zuvelpa01    1989    ATL  145000  0.310680
zuvelpa01    1989    ATL  145000  0.169811
zuvelpa01    1989    ATL  145000  0.176471
zuvelpa01    1989    ATL  145000  0.275362
zuvelpa01    1989    ATL  145000  0.300000

In [26]:
positions = pd.read_csv('data/Fielding.csv', index_col=0, usecols=['playerID','yearID','teamID','POS'])

In [27]:
positions.head()

           yearID teamID POS
playerID
abercda01    1871    TRO  SS
addybo01     1871    RC1  2B
addybo01     1871    RC1  SS
allisar01    1871    CL1  2B
allisar01    1871    CL1  OF

In [28]:
sal_bat_pos = salaries_batting.merge(positions, left_index=True, right_index=True, on=['yearID','teamID'])

In [29]:
sal_bat_pos.head()

           yearID teamID  salary  OBP POS
playerID
aardsda01    2004    SFN  300000  0.0   P
aardsda01    2004    SFN  300000  0.0   P
aardsda01    2004    SFN  300000  0.0   P
aardsda01    2004    SFN  300000  0.0   P
aardsda01    2004    SFN  300000  0.0   P

In [30]:
names = pd.read_csv('data/Master.csv', index_col=0, usecols=['playerID','nameFirst','nameLast'])

In [31]:
names.head()

          nameFirst nameLast
playerID
aardsda01     David  Aardsma
aaronha01      Hank    Aaron
aaronto01    Tommie    Aaron
aasedo01        Don     Aase
abadan01       Andy     Abad

In [32]:
master = names.merge(sal_bat_pos, left_index=True, right_index=True)

In [33]:
master.head()

          nameFirst nameLast  yearID teamID  salary  OBP POS
playerID
aardsda01     David  Aardsma    2004    SFN  300000  0.0   P
aardsda01     David  Aardsma    2004    SFN  300000  0.0   P
aardsda01     David  Aardsma    2004    SFN  300000  0.0   P
aardsda01     David  Aardsma    2004    SFN  300000  0.0   P
aardsda01     David  Aardsma    2004    SFN  300000  0.0   P

In [34]:
master.tail()

          nameFirst nameLast  yearID teamID  salary  OBP POS
playerID
zuvelpa01      Paul  Zuvella    1989    ATL  145000  0.3  SS
zuvelpa01      Paul  Zuvella    1989    ATL  145000  0.3  3B
zuvelpa01      Paul  Zuvella    1989    ATL  145000  0.3  DH
zuvelpa01      Paul  Zuvella    1989    ATL  145000  0.3  SS
zuvelpa01      Paul  Zuvella    1989    ATL  145000  0.3  3B

lolwut is going on with the dooplicate valooz?

In [35]:
master = master.drop_duplicates()

In [36]:
master.head()

          nameFirst nameLast  yearID teamID   salary  OBP POS
playerID
aardsda01     David  Aardsma    2004    SFN   300000  0.0   P
aardsda01     David  Aardsma    2007    CHA   387500  0.0   P
aardsda01     David  Aardsma    2008    BOS   403250  0.0   P
aardsda01     David  Aardsma    2009    SEA   419000  0.0   P
aardsda01     David  Aardsma    2010    SEA  2750000  0.0   P

In [37]:
master = master.sort(['salary', 'OBP'],ascending=[True, False])

/usr/local/lib/python3.5/site-packages/ipykernel/__main__.py:1: FutureWarning: sort(columns=....) is deprecated, use sort_values(by=.....)
  if __name__ == '__main__':

In [38]:
master.head()

          nameFirst nameLast  yearID teamID  salary       OBP POS
playerID
jamesdi01      Dion    James    1993    NYA       0  0.397188  CF
jamesdi01      Dion    James    1993    NYA       0  0.397188  DH
jamesdi01      Dion    James    1993    NYA       0  0.397188  LF
jamesdi01      Dion    James    1993    NYA       0  0.397188  OF
jamesdi01      Dion    James    1993    NYA       0  0.397188  RF

Seriously, who plays for free?

In [39]:
master = master[master['salary'] != 0]

In [40]:
master.head()

          nameFirst   nameLast  yearID teamID  salary       OBP POS
playerID
silveda01      Dave  Silvestri    1993    NYA   10900  0.423077  SS
silveda01      Dave  Silvestri    1993    NYA   10900  0.423077  3B
silveda01      Dave  Silvestri    1993    NYA   10900  0.423077  2B
silveda01      Dave  Silvestri    1993    NYA   10900  0.423077  1B
silveda01      Dave  Silvestri    1993    NYA   10900  0.423077  DH

A good measure of a player's value might be OBP/$. Let's create that in our master dataframe.

In [101]:
master['OBP/$'] = (master['OBP'] / master['salary']) * 100000

In [102]:
master.head()

          nameFirst   nameLast  yearID teamID  salary       OBP POS    OBP/$
playerID
silveda01      Dave  Silvestri    1993    NYA   10900  0.423077  SS  3.88144
silveda01      Dave  Silvestri    1993    NYA   10900  0.423077  3B  3.88144
silveda01      Dave  Silvestri    1993    NYA   10900  0.423077  2B  3.88144
silveda01      Dave  Silvestri    1993    NYA   10900  0.423077  1B  3.88144
silveda01      Dave  Silvestri    1993    NYA   10900  0.423077  DH  3.88144

In [112]:
def best_player(df, year, pos):
    grouped = df.groupby('yearID')
    t = (group.sort_values(by='OBP/$',ascending=False) for yr,group in grouped)
    topobpperdoll = pd.DataFrame()
    for line in t:
        topobpperdoll = topobpperdoll.append(line)
    return topobpperdoll[(topobpperdoll.yearID == year) & (topobpperdoll.POS == pos)][:1]

In [113]:
kkv = best_player(master, 2005, 'SS')

In [114]:
kkv

          nameFirst nameLast  yearID teamID  salary       OBP POS     OBP/$
playerID
amezaal01   Alfredo  Amezaga    2005    COL  320000  0.538462  SS  0.168269